/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isspace.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: seojepar <seojepar@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/11/19 13:03:11 by seojepar          #+#    #+#             */
/*   Updated: 2024/11/19 13:20:38 by seojepar         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
// 우연히 isspace 구현을 검색하다가 알게된 신기한 구현방법
// index를 리턴한다는게 재밌다.
int ft_isspace(const char *s)
{
    int i;

    i = 0;
    // while ((9 <= s[i] && s[i] <= 13 )|| s[i] == 32)
    //     i++;
    while (s[i] == ' ')
        i++;
    return (i);
}